In [5]:
import pandas as pd

In [6]:
## 데이터 시리즈 만들기
s = pd.Series(['Wes Mckinney','Creator of Pandas'])
print(s)

0         Wes Mckinney
1    Creator of Pandas
dtype: object

In [8]:
s=pd.Series(['W.Mckiney','Creator of Pandas'],index=['Person','who'])
print(s)

Person            W.Mckiney
who       Creator of Pandas
dtype: object

In [10]:
scientists=pd.DataFrame({
    'Name':['Roaline Franklin','Wiliam Gosset'],
    'Occupation' : ['chemist','statistician'],
    'Born' : ['1920-07-25','1876-06-13'],
    'Died' : ['1958-04-16','1937-10-16'],
    'Age':[37,61]}
)

In [11]:
print(scientists)

               Name    Occupation        Born        Died  Age
0  Roaline Franklin       chemist  1920-07-25  1958-04-16   37
1     Wiliam Gosset  statistician  1876-06-13  1937-10-16   61

In [19]:
scientists =pd.DataFrame(
    data={'Ocucupation': ['Chemist','Statistician'],
    'Born' : ['1920-07-25','1876-06-13'],
    'Died' : ['1958-04-16','1937-10-16'],
    'Age':[37,61]},
    index=['Roaline Franklin','Wiliam Gosset'],
    columns=['Ocucupation','Born','Age','Died'])
print(scientists)

                   Ocucupation        Born  Age        Died
Roaline Franklin       Chemist  1920-07-25   37  1958-04-16
Wiliam Gosset     Statistician  1876-06-13   61  1937-10-16

In [18]:
first_row=scientists.loc['Wiliam Gosset']
print(first_row)

Ocucupation    Statistician
Born             1876-06-13
Age                      61
Died             1937-10-16
Name: Wiliam Gosset, dtype: object

In [20]:
print(first_row.index) #왼쪽에 있는것

Index(['Ocucupation', 'Born', 'Age', 'Died'], dtype='object')

In [22]:
print(first_row.values)  ##오른쪽에 있는것

['Statistician' '1876-06-13' 61 '1937-10-16']

In [23]:
print(first_row.keys())

Index(['Ocucupation', 'Born', 'Age', 'Died'], dtype='object')

In [24]:
## 기초통계 메소드

In [27]:
ages = scientists['Age']
print(ages)

Roaline Franklin    37
Wiliam Gosset       61
Name: Age, dtype: int64

In [29]:
print(ages.mean())
print(ages.min())
print(ages.max())
print(ages.std())

49.0
37
61
16.97056274847714

In [33]:
scientists.describe()   ##요약 통계!

             Age
count   2.000000
mean   49.000000
std    16.970563
min    37.000000
25%    43.000000
50%    49.000000
75%    55.000000
max    61.000000

In [34]:
##시리즈 응용
scientists =pd.read_csv('./data/scientists.csv')

In [45]:
ages = scientists['Age']
print(ages)
print(ages.max())
print(ages.min())
print(ages[ages>ages.mean()])
print(ages>ages.mean())
print(type(ages>ages.mean()))
m_bool_values= [True,True,False,False,True,True,False,True]
print(ages[m_bool_values])

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64
90
37
1    61
2    90
3    66
7    77
Name: Age, dtype: int64
0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool
<class 'pandas.core.series.Series'>
0    37
1    61
4    56
5    45
7    77
Name: Age, dtype: int64

In [48]:
##시리즈 브로드캐스팅
print(ages+ages)
print(ages+100)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64
0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [50]:
print(pd.Series([1,100]))
print(ages + pd.Series([1,100]))

0      1
1    100
dtype: int64
0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [52]:
##sort_index  인덱스 기준 정렬
rev_ages=ages.sort_index(ascending=False)
print(rev_ages)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [53]:
##불린
print(scientists[scientists['Age']>scientists['Age'].mean()])

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [55]:
scientists[scientists['Occupation']=='chemist']

Empty DataFrame
Columns: [Name, Born, Died, Age, Occupation]
Index: []

In [56]:
print(scientists['Born'].dtype)

object

In [59]:
born_datetime=pd.to_datetime(scientists['Born'],format='%Y-%m-%d')
print(born_datetime)

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [61]:
died_datetime=pd.to_datetime(scientists['Died'],format='%Y-%m-%d')
print(died_datetime)

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [68]:
## 열추가
scientists['born_dt'],scientists['died_dt']=(born_datetime,died_datetime)
scientists.head()

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14

In [72]:
scientists2=scientists.loc[:,['Name','born_dt','died_dt','Age','Occupation']]
scientists2

                   Name    born_dt    died_dt  Age          Occupation
0     Rosaline Franklin 1920-07-25 1958-04-16   37             Chemist
1        William Gosset 1876-06-13 1937-10-16   61        Statistician
2  Florence Nightingale 1820-05-12 1910-08-13   90               Nurse
3           Marie Curie 1867-11-07 1934-07-04   66             Chemist
4         Rachel Carson 1907-05-27 1964-04-14   56           Biologist
5             John Snow 1813-03-15 1858-06-16   45           Physician
6           Alan Turing 1912-06-23 1954-06-07   41  Computer Scientist
7          Johann Gauss 1777-04-30 1855-02-23   77       Mathematician

In [74]:
scientists['age_days_dt']=(scientists['died_dt']-scientists['born_dt'])
print(scientists)

                   Name        Born        Died  Age          Occupation  \
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

     born_dt    died_dt age_days_dt
0 1920-07-25 1958-04-16  13779 days
1 1876-06-13 1937-10-16  22404 days
2 1820-05-12 1910-08-13  32964 days
3 1867-11-07 1934-07-04  24345 days
4 1907-05-27 1964-04-14  20777 days
5 1813-03-15 1858-06-16  16529 days
6 1912-06-23 1954-06-07  15324 days
7 1777-04-30 1855-02-23  28422 days

In [80]:
##데이터프레임 삭제하기  
scientists.drop(0).head(2)
scientists.drop([0,3])

scientists.drop(['Name'],axis=1)

,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [83]:
scientists3=scientists.drop(['Age','Occupation'],axis=1) ## 저장이 안됨 하려면 새로운 값을 넣음

In [85]:
scientists3 =scientists.copy()

In [86]:
list1=[1,2,3]

In [94]:
list2=list1.copy()

In [95]:
list2

[1, 4, 3]

In [96]:
list2[1]=4

In [97]:
list2

[1, 4, 3]

In [98]:
list1

[1, 4, 3]

In [99]:
list1 is list2

False

In [100]:
##데이터 저장하고 불러오기
names = scientists['Name']
names.to_pickle('./data/scientists_names_series.pickle')

In [102]:
scientists.to_csv('./data/scientists.csv')

In [105]:
df=pd.read_csv('./data/scientists.csv')
df

,Unnamed: 0,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [107]:
df=pd.read_csv('./data/scientists.csv',index_col=0)  ##0번째 자리를 인데스로 하겠다
df

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [108]:
!conda install -y openpyxl

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.

In [111]:
names_df=scientists['Name'].to_frame()

In [112]:
import xlwt

In [113]:
names_df.to_excel('./data/scientists_names_series_df.xls')

C:\Users\admin\AppData\Local\Temp\ipykernel_11392\1046304977.py:1: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  names_df.to_excel('./data/scientists_names_series_df.xls')

In [114]:
import openpyxl

In [115]:
names_df.to_excel('./data/scientists_names_series_df.xlsx')

CommandNotFoundError: No command 'conda xld'.